;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el


(package! flycheck-aspell)
(package! calfw)
(package! calfw-org)
(package! dashboard)
(package! dired-open)
(package! dired-subtree)
(package! dmenu)
(package! elfeed-goodies)
(package! emojify)
(package! evil-tutor)
(package! exwm)
(package! ivy-posframe)
(package! mw-thesaurus)
(package! org-auto-tangle)
(package! org-web-tools)
(package! ox-gemini)
(package! peep-dired)
(package! password-store)
(package! rainbow-mode)
(package! resize-window)
(package! tldr)
(package! wc-mode)
(package! beacon)
(package! clippy)
(package! minimap)
(package! olivetti)
(package! yasnippet)
(package! flycheck)
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-java)
(package! dap-mode)
(package! helm-lsp)
(package! helm)
(package! lsp-treemacs)
(package! org-bullets)
(package! visual-fill-column)
(package! devdocs)
(package! doom-themes)
(package! mvn)
(package! neotree)
(package! projectile)
(package! javadoc-lookup)
(package! maven-test-mode)
(package! java-imports)
(package! eglot)
;;sql
(package! format-sql)
(package! pg)
(package! sql-indent)
;;latex
(package! evil-tex)
(package! auctex)
(package! lsp-latex)
(package! academic-phrases)
(package! latex-preview-pane)
(package! pdf-tools)
;;org latex
(package! org-latex-impatient)

;; useful for when on windows
(if (eq system-type 'windows-nt )
    (package! powershell)
)
(package! restclient)
